yisea123/mango-stm32f0/src/main.c
#include "main.h"
#include "mango.h"
#include "stm32f0xx_hal.h"

static void Error_Handler(void) {
  while (1) {
  }
}

static void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL12;
  RCC_OscInitStruct.PLL.PREDIV = RCC_PREDIV_DIV1;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    Error_Handler();
  }

  RCC_ClkInitStruct.ClockType =
      RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK) {
    Error_Handler();
  }

  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

static void MX_GPIO_Init(void) {
  GPIO_InitTypeDef GPIO_InitStruct;

  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();

  GPIO_InitStruct.Pin = B1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = LD4_Pin | LD3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  HAL_GPIO_WritePin(GPIOC, LD4_Pin | LD3_Pin, GPIO_PIN_RESET);
}

////////////////////////////////////////////////////////////////////////////////

uint8_t memory[128];

#include "demo.inc"

int main(void) {
  HAL_Init();
  SystemClock_Config();
  MX_GPIO_Init();

  mango_vm *vm = mango_initialize(memory, sizeof(memory), NULL);
  if (!vm) {
    return 0;
  }

  if (mango_stack_create(vm, 32)) {
    return 0;
  }

  if (mango_module_import(vm, demo_name, demo_code, sizeof(demo_code), NULL,
                          MANGO_IMPORT_TRUSTED_MODULE |
                              MANGO_IMPORT_SKIP_VERIFICATION)) {
    return 0;
  }

  while (1) {
    switch (mango_execute(vm)) {
    default:
      return 0;
    case MANGO_E_SUCCESS:
      return 0;
    case MANGO_E_SYSCALL:
      switch (mango_syscall(vm)) {
      case 99:
        *(int32_t *)mango_stack_alloc(vm, 4, 0) =
            (HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin) == GPIO_PIN_SET);
        break;
      case 100:
        HAL_GPIO_WritePin(LD4_GPIO_Port, LD4_Pin, GPIO_PIN_SET);
        break;
      case 101:
        HAL_GPIO_WritePin(LD4_GPIO_Port, LD4_Pin, GPIO_PIN_RESET);
        break;
      case 102:
        HAL_GPIO_TogglePin(LD3_GPIO_Port, LD3_Pin);
        break;
      case 103:
        HAL_GPIO_WritePin(LD3_GPIO_Port, LD3_Pin, GPIO_PIN_RESET);
        break;
      case 104:
        HAL_Delay(*(int32_t *)mango_stack_top(vm));
        mango_stack_free(vm, sizeof(int32_t));
        break;
      }
      break;
    }
  }
}
